from pyb import Pin

r=[Pin(i, Pin.OUT_PP) for i in ['X2','X1','X3','X4','X5','X6','X8','X7']]
for i in range (8):
	r[i].high()

c=[Pin(i, Pin.OUT_PP) for i in ['Y2','Y1','Y3','Y4','Y5','Y6','Y8','Y7']]
for i in range (8):
	c[i].high()

def line(row,colDisp):
	r[row-1].low() #打开某行
	for j in colDisp: 
		if (j>=0 and j<=7):
			c[j].low()#开启
			pyb.delay(1)
			c[j].high()#熄灭
	r[row-1].high()#关闭行

png1=[ #剪刀
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"00****00",
	"000***00",
	"000***00",
	"00*000*0"
]
png2=[ #石头
	"00000000",
	"00*****0",
	"00*****0",
	"00*****0",
	"00*****0",
	"00*****0",
	"000***00",
	"00000000"
]
png3=[ #布
	"00000000",
	"000*0000",
	"00***000",
	"00****00",
	"0******0",
	"0******0",
	"0*****00",
	"00000000"
]
png_0=[
	"00****00",
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"0*0000*0",
	"00****00",
	]
png_1=[
	"000**000",
	"000**000",
	"00***000",
	"000**000",
	"000**000",
	"000**000",
	"000**000",
	"0******0",
	]
png_2=[
	"000**000",
	"0**00**0",
	"*000**00",
	"0000**00",
	"000**000",
	"000**000",
	"00**0000",
	"0*******",
	]
def show_png(png):
	temp=list(png)
	b=png[0]
	letter=[[],[],[],[],[],[],[],[]]
	a=[]
	#print(temp)
	for i in range(8):
		for j in range(8):
			if temp[i][j]=="*":
				letter[i].append(j)
	print(letter)
	for k in range(100):
		for  i in range(8):
			line(i+1,letter[i])


while True:
	show_png(png)
